OldReleases/OF5and6/OFtutorial12_momentumSource/testCase/Allrun
#!/bin/bash

blockMesh > log.blockMesh
simpleFoam
echo "Now run: paraview --state=viewData.pvsm"
